1. Crear series a partir de listas y arrays unidimensionales.

2. Crear series especificando las etiquetas del índice.

3. Crear dataframes a partir de listas anidadas, arrays
bidimensionales y diccionarios.

4. Crear dataframes especificando etiquetas para filas y columnas.

5. Crear un dataframe a partir del archivo “titanic.csv”

6. Visualizar las propiedades del dataframe.

In [3]:
#1
import pandas as pd
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [5]:
#2
pd.Series([1,2,3], index=["A", "B", "C"])

A    1
B    2
C    3
dtype: int64

In [14]:
#3
pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [16]:
#4
pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], index=["f1", "f2", "f3"], columns=["c1", "c2", "c3"])

    c1  c2  c3
f1   1   2   3
f2   4   5   6
f3   7   8   9

In [20]:
#5
db=pd.read_csv("titanic.csv")
db

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
#6
db.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB